Repository: foudfou/cpp-termites
Catalog: i18n/*/termites.po
Languages: fr

source: Cannot open log file: %s.
fr: Ne peut ouvrir le fichier de log: %s.

source: Cannot read configuration file: %s.
fr: Ne peut lire le fichier de configuration: %s.

source: Cell (%d, %d) already occupied.
fr: Cellule (%d, %d) déjà occupée.

source: Config already initialized.
fr: Config déjà initialisée.

source: Config has errors: %s.
fr: Config a des erreurs: %s.

source: Config parsed to the end: %s.
fr: Config parsée jusu'à la fin: %s.

source: Configuration file set to %s.
fr: Fichier de configuration positionné à %s.

source: Duplicate item: %s.
fr: Champ en double: %s.

source: Duplicate key ignored: %s
fr: Clef en double ignorée: %s.

source: Error line %d on char '%c' after '%c'.
fr: Erreur à la ligne %d au caractère '%c' après '%c'.

source: Invalid argument: %s.
fr: Argument invalide: %s.

source: Missing chip definition: %s
fr: Définition de copeau manquante: %s.

source: Missing chip positions.
fr: Positions des copeaux manquantes.

source: Missing options or configuration file.
fr: Options ou fichier de configuration manquants.

source: Missing termite positions.
fr: Positions de termites manquantes.

source: More than one configuration file given.
fr: Plus d'un fichier de configuration fournis.

source: Parse error at line %d.
fr: Erreur de parsing à la ligne %d.

source: Please provide all options (height, width, termites, chips, tics).
fr: Merci de fournir toutes les options (hauteur, largeur, termites, copeaux, temps).

source: Please provide either a configuration file or all mandatory options (height, width, termites, chips, tics).
fr: Merci de fournir soit un fichier de configuration, soit toutes les options obligatoires (hauteur, largeur, termites, copeaux, temps)

source: Position out of bounds (at %d, %d).
fr: Position hors limites (%d, %d)

source: Termite at (%d, %d) can't move to already occupied (%d, %d).
fr: Le Termite sur (%d, %d) ne peut pas se déplacer vers la case déjà occupée (%d, %d).

source: Too many termites and chips for board size.
fr: Trop de termites et copeau pour la taille du tableau.

source: Undefined option '%c'.
fr: Option '%c' non-définie.

source: Undefined parameter 'chips'.
fr: Paramètre 'copeau' non-défini.

source: Undefined parameter 'height'.
fr: Paramètre 'hauteur' non-défini.

source: Undefined parameter 'species'.
fr: Paramètre 'copeau' non-défini.

source: Undefined parameter 'tics'.
fr: Paramètre 'temps' non-défini.

source: Undefined parameter 'width'.
fr: Paramètre 'largeur' non-défini.

source: Unknown entity store.
fr: Conteneur d'entités inconnu.

source: Wood species '%s' (at %d, %d) is not defined in global species.
fr: Espèce de bois '%s' (at %d, %d) non défini dans les espèces globales.

source: entitiy positions: %s.
fr: positions des entités: %s.

source: height set to %d
fr: hautreur positionnée à %d

source: tics set to %d
fr: temps positionné à %d

source: width set to %d
fr: largeur positionnée à %d
